## Pandas group by

In [1]:
# pandas groupby function is used to split the data in to group based on some criteria

In [2]:
# mainly group by function ka use data ko split karne ke liye hota hai 
# group by function ka use karke hum data ko different different groups me split kar sakte hai

##### group by operations

In [3]:
# any group by operation involves one of the following operations on the original object 
#---Spliting the object 
#---Applying a function
#---Combining the result

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('C:\\Users\\Admin\\Downloads\\student data.csv')
df

   Student ID Section  Class  Study hrs  Social Media Usage hrs  Percantege
0        1001       A     10          2                       3          50
1        1002       B     10          6                       2          80
2        1003       A     10          3                       2          60
3        1004       C     11          0                       1          45
4        1005       C     12          5                       2          75

In [15]:
# Now we applly group by function 
# Label group

In [16]:
gr1 = df.groupby(by = 'Section') # in this we use single label 
gr1

In [5]:
gr1.groups

{'A': [0, 2], 'B': [1], 'C': [3, 4]}

In [12]:
gr2 = df.groupby(['Section','Percantege']) # in this we use double label 
gr2

In [13]:
gr2.groups

{('A', 50): [0], ('A', 60): [2], ('B', 80): [1], ('C', 45): [3], ('C', 75): [4]}

In [19]:
# to show group by object 
for section,df_1 in gr1:
    print(section)
    print(df_1)

# means all the data is divided in to sections 
# A having its own section 1001
#                          1003
# B having its own section 1002

# C having its own section 1004
#                          1005

A
   Student ID Section  Class  Study hrs  Social Media Usage hrs  Percantege
0        1001       A     10          2                       3          50
2        1003       A     10          3                       2          60
B
   Student ID Section  Class  Study hrs  Social Media Usage hrs  Percantege
1        1002       B     10          6                       2          80
C
   Student ID Section  Class  Study hrs  Social Media Usage hrs  Percantege
3        1004       C     11          0                       1          45
4        1005       C     12          5                       2          75

In [20]:
# same table ko hum list me bhi convert kar sakte hai 
list(gr1)

[('A',
     Student ID Section  Class  Study hrs  Social Media Usage hrs  Percantege
  0        1001       A     10          2                       3          50
  2        1003       A     10          3                       2          60),
 ('B',
     Student ID Section  Class  Study hrs  Social Media Usage hrs  Percantege
  1        1002       B     10          6                       2          80),
 ('C',
     Student ID Section  Class  Study hrs  Social Media Usage hrs  Percantege
  3        1004       C     11          0                       1          45
  4        1005       C     12          5                       2          75)]

In [23]:
# same table converted in to dictionary 
dict(list(gr1))

{'A':    Student ID Section  Class  Study hrs  Social Media Usage hrs  Percantege
 0        1001       A     10          2                       3          50
 2        1003       A     10          3                       2          60,
 'B':    Student ID Section  Class  Study hrs  Social Media Usage hrs  Percantege
 1        1002       B     10          6                       2          80,
 'C':    Student ID Section  Class  Study hrs  Social Media Usage hrs  Percantege
 3        1004       C     11          0                       1          45
 4        1005       C     12          5                       2          75}

#### Group spliting

In [26]:
#  if  we want any group according to any specific value then we use this function 
#  like we take a class section and we want group which having only 10 value 

gr3 = df.groupby('Class').get_group(10)
gr3



# here we got a group which have value only 10

   Student ID Section  Class  Study hrs  Social Media Usage hrs  Percantege
0        1001       A     10          2                       3          50
1        1002       B     10          6                       2          80
2        1003       A     10          3                       2          60

In [30]:
# now we cange the value and print an other group 

gr4 = df.groupby('Section').get_group('A')
gr4

#  so we got a group which having only A 
# mens the data frame is split according to the section "A"

   Student ID Section  Class  Study hrs  Social Media Usage hrs  Percantege
0        1001       A     10          2                       3          50
2        1003       A     10          3                       2          60

#####  Single Functions in a Group

In [31]:
# sum 
gr1.sum()

# sum function mens which row having a same id then that will be added

         Student ID  Class  Study hrs  Social Media Usage hrs  Percantege
Section
A              2004     20          5                       5         110
B              1002     10          6                       2          80
C              2009     23          5                       3         120

In [32]:
# mean
gr1.mean()

# here the mean value is find out according to the setions

         Student ID  Class  Study hrs  Social Media Usage hrs  Percantege
Section
A            1002.0   10.0        2.5                     2.5        55.0
B            1002.0   10.0        6.0                     2.0        80.0
C            1004.5   11.5        2.5                     1.5        60.0

In [34]:
# Describe
gr1.describe()

# here is the over all description of table

        Student ID                                                      \
             count    mean       std     min      25%     50%      75%
Section
A              2.0  1002.0  1.414214  1001.0  1001.50  1002.0  1002.50
B              1.0  1002.0       NaN  1002.0  1002.00  1002.0  1002.00
C              2.0  1004.5  0.707107  1004.0  1004.25  1004.5  1004.75

                Class        ... Social Media Usage hrs      Percantege        \
            max count  mean  ...                    75%  max      count  mean
Section                      ...
A        1003.0   2.0  10.0  ...                   2.75  3.0        2.0  55.0
B        1002.0   1.0  10.0  ...                   2.00  2.0        1.0  80.0
C        1005.0   2.0  11.5  ...                   1.75  2.0        2.0  60.0


               std   min   25%   50%   75%   max
Section
A         7.071068  50.0  52.5  55.0  57.5  60.0
B              NaN  80.0  80.0  80.0  80.0  80.0
C        21.213203  45.0  52.5  60.0  67.5  75.0

[3 rows x 40 columns]

##### Multiple Functions in a Group

In [35]:
# inn that function we have to use some specific functions like aggregate

gr1.agg(['sum','max','mean'])

# Every column having a specific functions like "sum","max","mean"

        Student ID               Class           Study hrs           \
               sum   max    mean   sum max  mean       sum max mean
Section
A             2004  1003  1002.0    20  10  10.0         5   3  2.5
B             1002  1002  1002.0    10  10  10.0         6   6  6.0
C             2009  1005  1004.5    23  12  11.5         5   5  2.5

        Social Media Usage hrs          Percantege
                           sum max mean        sum max  mean
Section
A                            5   3  2.5        110  60  55.0
B                            2   2  2.0         80  80  80.0
C                            3   2  1.5        120  75  60.0